// note: keep English for Zikronium-specific terms: source, ID, group, event

/* ***** Errors ***** */

/* NumberOfSpeakerExceedsLimitError */
"NumberOfSpeakerExceedsLimitError.ErrorDescription" = "Cannot add speaker";
"NumberOfSpeakerExceedsLimitError.RecoverySuggestion" = "Maximum number of speakers used in Zirkonium3 is 64";

/* XMLReadError */
"XMLReadError.ErrorDescription" = "Could not read XML";
"XMLReadError.RecoverySuggestion" = ""; // replaced by actual error suggestion

/* XMLWriteError */
"XMLWriteError.ErrorDescription" = "Could not write XML";
"XMLWriteError.RecoverySuggestion" = ""; // replaced by actual error suggestion

/* InvalidRootError */
"InvalidRootError.ErrorDescription" = "Invalid speaker setup XML syntax";
"InvalidRootError.RecoverySuggestion" = "The root element must be \"SpeakerSetup\". Is this a speaker setup XML file?";

/* NoDimensionInXMLError */
"NoDimensionInXMLError.ErrorDescription" = "Invalid speaker setup XML syntax";
"NoDimensionInXMLError.RecoverySuggestion" = "Dimension attribute missing. Is this a speaker setup XML file?";

/* NoModeInXMLError */
"NoModeInXMLError.ErrorDescription" = "Invalid speaker setup XML syntax";
"NoModeInXMLError.RecoverySuggestion" = "MK3 speaker setup detected, however Mode attribute is missing.";

/* InvalidDimensionError */
"InvalidDimensionError.ErrorDescription" = "Invalid speaker setup XML syntax";
"InvalidDimensionError.RecoverySuggestion" = "The speaker setup Dimension attribute must be 2 or 3.";

/* InvalidVersionError */
"InvalidVersionError.ErrorDescription" = "Invalid speaker setup XML syntax";
"InvalidVersionError.RecoverySuggestion" = "MK3 speaker setup detected, however Version attribute is invalid. Value must be >= 3.0.";

/* InvalidModeError */
"InvalidModeError.ErrorDescription" = "Invalid speaker setup XML syntax";
"InvalidModeError.RecoverySuggestion" = "MK3 speaker setup detected, however Mode attribute is invalid. Value must be \"Metric\" or \"Relative.\"";

/* DuplicateSpeakerIndicesError */
"DuplicateSpeakerIndicesError.ErrorDescription" = "Cannot change speaker index";
"DuplicateSpeakerIndicesError.RecoverySuggestion"  = "Duplicate speaker index found. Speaker indices must be unique.";

/* ***** Warnings ***** */

/* ClearSpeakerWarning */
"ClearSpeakerWarning.ErrorDescription" = "Are you sure?";
"ClearSpeakerWarning.RecoverySuggestion" = "All speakers in the scene will be deleted.";

/* LoadXMLWarning */
"LoadXMLWarning.ErrorDescription" = "Clear current setup?";
"LoadXMLWarning.RecoverySuggestion" = "Loading an XML file will clear all speakers in the scene.";

/* ***** Panels ***** */

"ImportPanel.message" = "Select a speaker setup XML file to load.\n\nSupported formats are Zirkonium MK2 and MK3 (Relative & Metric).";
"ExportPanel.message" = "Export current speaker setup to a Zirkonium MK3 XML file.";
